modules/gateway/server/src/test/resources/com/l7tech/server/policy/assertion/SqlAttack_MsSqlServerExploit_xp.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        >
    <soapenv:Body>
        <addPlayer xmlns="http://playerstatsws.test.l7tech.com">
            <player>
                <FName>exec xp_smtp_sendmail</FName>
                <LName>SqlAttack</LName>
                <age>30</age>
                <dob>1975-02-02</dob>
                <draftDetails>
                    <pick>23</pick>
                    <round>1</round>
                    <team>Islanders</team>
                    <year>1993</year>
                </draftDetails>
                <number>902</number>
                <offensiveStats>
                    <assists>43</assists>
                    <gamesPlayed>69</gamesPlayed>
                    <goals>17</goals>
                    <penaltyMins>122</penaltyMins>
                    <plusMinus>21</plusMinus>
                    <points>60</points>
                </offensiveStats>
                <physicalStats>
                    <height>6-3</height>
                    <position>RW</position>
                    <shoots>Left</shoots>
                    <weight>245</weight>
                </physicalStats>
            </player>
            <delay>0</delay>
        </addPlayer>
    </soapenv:Body>
</soapenv:Envelope>
